# Reshaping Tables With MultiIndex

 Data manipulation is a significant step of data analysis process. While manipulating data, 'Multi-level Indexing' may allow you to take an alternative approach to the data. Using multi index sometimes seriously helps you to take a different aspect to the data, but sometimes it is a must. There are various ways for creating multi index and I will show some of them.

Firstly, I will import titanic dataset from Seaborn library. Using built-in datasets is a practical way of exercising for data analysis. I want to see  the situation of "age" and "survived" variables according to "sex" and "class" varibles, so I selected only those columns from the dataset. I will show the first 5 rows with head() function to have a quick insight of the dataset.

In [108]:
import seaborn as sns
df = sns.load_dataset("titanic")
df = df[["sex","class","age","survived"]]
df.head(5)

      sex  class   age  survived
0    male  Third  22.0         0
1  female  First  38.0         1
2  female  Third  26.0         1
3  female  First  35.0         1
4    male  Third  35.0         0

### pandas.DataFrame.set_index()

Now, I will construct multi index with DataFrame.set_index() for "sex" and "class" columns in titanic dataset. set_index() function creates multi index, but it does not group by according to indexes with aggregation functions. This could be used to handle non-numeric data. If you want to apply aggregation functions on values, group_by() and pivot_table() functions will be useful.

In [109]:
multiindex_set = df.iloc[:10,:].set_index(["sex","class"])
multiindex_set

                age  survived
sex    class
male   Third   22.0         0
female First   38.0         1
       Third   26.0         1
       First   35.0         1
male   Third   35.0         0
       Third    NaN         0
       First   54.0         0
       Third    2.0         0
female Third   27.0         1
       Second  14.0         1

In [87]:
multiindex_set.index

MultiIndex([(  'male',  'Third'),
            ('female',  'First'),
            ('female',  'Third'),
            ('female',  'First'),
            (  'male',  'Third'),
            (  'male',  'Third'),
            (  'male',  'First'),
            (  'male',  'Third'),
            ('female',  'Third'),
            ('female', 'Second')],
           names=['sex', 'class'])

### DataFrame.group_by() & pandas.pivot_table()

group_by() and pivot_table() functions allow us to apply aggregation functions over values according to indexes. Furthermore we can apply multiple types of aggregations for any column with the help of group_by() and pivot_table() functions

In [110]:
multiindex_groupby = df.groupby(["sex","class"]).agg({"age":"min","survived":"median"})
multiindex_groupby

                age  survived
sex    class
female First   2.00       1.0
       Second  2.00       1.0
       Third   0.75       0.5
male   First   0.92       0.0
       Second  0.67       0.0
       Third   0.42       0.0

In [111]:
multiindex_groupby.index

MultiIndex([('female',  'First'),
            ('female', 'Second'),
            ('female',  'Third'),
            (  'male',  'First'),
            (  'male', 'Second'),
            (  'male',  'Third')],
           names=['sex', 'class'])

In [120]:
multiindex_pivottable = pd.pivot_table(df, values=["survived","age"], index=["sex","class"], aggfunc={"age":[min,"max",np.mean],"survived":np.mean})
multiindex_pivottable

                age                   survived
                max       mean   min      mean
sex    class
female First   63.0  34.611765  2.00  0.968085
       Second  57.0  28.722973  2.00  0.921053
       Third   63.0  21.750000  0.75  0.500000
male   First   80.0  41.281386  0.92  0.368852
       Second  70.0  30.740707  0.67  0.157407
       Third   74.0  26.507589  0.42  0.135447

Additionally, if we want to filter according to one or more index on a multi indexed dataframe, we can use iloc or loc for selection.

In [113]:
multiindex_pivottable.loc["female","First"]

age         63.0
survived     1.0
Name: (female, First), dtype: float64

In [123]:
multiindex_pivottable.iloc[1,2]

2.0

There are many other issues about reshaping dataframes as a part of data analysis. I tried to show how to construct multi-indexed dataframes with some simple examples in my post. See